# Pandas Kütüphanesi
Veri analizi ve veri manipülasyonu için kullanılan bir kütüphanedir.

In [2]:
!pip install pandas

Collecting pandas
  Using cached pandas-1.3.5-cp37-cp37m-win_amd64.whl (10.0 MB)
Collecting pytz>=2017.3
  Downloading pytz-2025.1-py2.py3-none-any.whl (507 kB)
     ------------------------------------ 507.9/507.9 kB 505.8 kB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\busra\anaconda3\envs\turkcell_gyk\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\users\busra\anaconda3\envs\turkcell_gyk\lib\site-packages (from pandas) (1.21.6)
Requirement already satisfied: six>=1.5 in c:\users\busra\anaconda3\envs\turkcell_gyk\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.3.5 pytz-2025.1

In [1]:
import pandas as pd

# Pandas Series
Tek boyutlu dizidir. (Exceldeki tek bir sütun gibi düşünülebilir)

In [4]:
series1 = pd.Series([10,20,30,40,50])
series1

0    10
1    20
2    30
3    40
4    50
dtype: int64

# Pandas Dataframe (Table)
Birden fazla sütun içeren bir tablo

In [5]:
data = {
    "Ad": ["Halit","Kudret","Sümeyye","Hilal"],
    "Yaş": [25,25,25,25],
    "Şehir":["İstanbul","Ankara","İzmir","Bursa"]
}
data

{'Ad': ['Halit', 'Kudret', 'Sümeyye', 'Hilal'],
 'Yaş': [25, 25, 25, 25],
 'Şehir': ['İstanbul', 'Ankara', 'İzmir', 'Bursa']}

In [6]:
df1 = pd.DataFrame(data)
df1

        Ad  Yaş     Şehir
0    Halit   25  İstanbul
1   Kudret   25    Ankara
2  Sümeyye   25     İzmir
3    Hilal   25     Bursa

In [8]:
type(df1)

pandas.core.frame.DataFrame

# CSV -> Comma,Seperated,Values

In [9]:
df2 = pd.read_csv("Chocolate Sales.csv")
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [11]:
df2.head(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
5,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,"$5,376",38
6,Oby Sorrel,UK,99% Dark & Pure,25-Jan-22,"$13,685",176
7,Gunar Cockshoot,Australia,After Nines,24-Mar-22,"$3,080",73
8,Jehu Rudeforth,New Zealand,50% Dark Bites,20-Apr-22,"$3,990",59
9,Brien Boise,Australia,99% Dark & Pure,04-Jul-22,"$2,835",102

In [12]:
df2.tail(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1084,Roddy Speechley,India,50% Dark Bites,14-Mar-22,"$8,337",12
1085,Barr Faughny,New Zealand,99% Dark & Pure,24-May-22,"$8,134",195
1086,Dennison Crosswaite,Canada,Organic Choco Syrup,28-Jan-22,"$8,491",75
1087,Beverie Moffet,India,Almond Choco,24-May-22,"$3,066",96
1088,Brien Boise,Australia,Peanut Butter Cubes,19-Aug-22,$301,205
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

## Sample methods gives random samples in our dataset

In [13]:
df2.sample(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
8,Jehu Rudeforth,New Zealand,50% Dark Bites,20-Apr-22,"$3,990",59
664,Husein Augar,Australia,White Choc,11-May-22,"$3,171",220
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
814,Van Tuxwell,New Zealand,Eclairs,01-Mar-22,"$5,229",182
72,Jehu Rudeforth,New Zealand,White Choc,11-Mar-22,"$2,800",241
235,Mallorie Waber,New Zealand,Organic Choco Syrup,01-Jul-22,"$5,075",256
934,Oby Sorrel,UK,White Choc,27-Jun-22,"$1,715",286
638,Gunar Cockshoot,India,Mint Chip Choco,08-Aug-22,"$4,256",67
266,Barr Faughny,USA,50% Dark Bites,14-Apr-22,"$13,034",117
132,Beverie Moffet,New Zealand,White Choc,24-Mar-22,"$7,126",7

In [14]:
df2.loc[21]

Sales Person         Gunar Cockshoot
Country                          USA
Product          Spicy Special Slims
Date                       17-Feb-22
Amount                       $1,267
Boxes Shipped                    157
Name: 21, dtype: object

In [15]:
df2.iloc[21]

Sales Person         Gunar Cockshoot
Country                          USA
Product          Spicy Special Slims
Date                       17-Feb-22
Amount                       $1,267
Boxes Shipped                    157
Name: 21, dtype: object

In [17]:
df2.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [18]:
df2.loc[0], df2.iloc[0]

(Sales Person      Jehu Rudeforth
 Country                       UK
 Product          Mint Chip Choco
 Date                   04-Jan-22
 Amount                   $5,320
 Boxes Shipped                180
 Name: 0, dtype: object,
 Sales Person      Jehu Rudeforth
 Country                       UK
 Product          Mint Chip Choco
 Date                   04-Jan-22
 Amount                   $5,320
 Boxes Shipped                180
 Name: 0, dtype: object)

## Difference between loc and iloc

In [21]:
ogrenci_notlari = pd.DataFrame({
    "Ad":["Ahmet","Mehmet","Zeynep","Elif"],
    "Matematik":[70,80,90,100],
    "Fizik":[90,75,85,95]
})
ogrenci_notlari

       Ad  Matematik  Fizik
0   Ahmet         70     90
1  Mehmet         80     75
2  Zeynep         90     85
3    Elif        100     95

In [22]:
ogrenci_notlari.iloc[1]

Ad           Mehmet
Matematik        80
Fizik            75
Name: 1, dtype: object

In [23]:
ogrenci_notlari.loc[2]

Ad           Zeynep
Matematik        90
Fizik            85
Name: 2, dtype: object

In [24]:
ogrenci_notlari.iloc[0,1]

70

In [25]:
ogrenci_notlari.loc[3,"Matematik"]

100

In [26]:
ogrenci_notlari.iloc[3,1]

100

In [27]:
ogrenci_notlari.loc[ogrenci_notlari["Ad"]=="Elif","Fizik"].values[0]

95

In [30]:
df2[ df2["Boxes Shipped"] > 300]

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
15,Beverie Moffet,Australia,Organic Choco Syrup,26-Jan-22,"$6,790",356
25,Karlen McCaffrey,India,Fruit & Nut Bars,26-Jan-22,$168,321
29,Dennison Crosswaite,New Zealand,Manuka Honey Choco,15-Jun-22,"$5,061",301
35,Roddy Speechley,USA,Manuka Honey Choco,22-Jul-22,"$9,583",315
...,...,...,...,...,...,...
1077,Oby Sorrel,Canada,Orange Choco,27-Apr-22,"$8,757",338
1083,Madelene Upcott,New Zealand,Milk Bars,29-Mar-22,"$12,558",403
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

## Null value check

In [31]:
df2.isnull()

      Sales Person  Country  Product   Date  Amount  Boxes Shipped
0            False    False    False  False   False          False
1            False    False    False  False   False          False
2            False    False    False  False   False          False
3            False    False    False  False   False          False
4            False    False    False  False   False          False
...            ...      ...      ...    ...     ...            ...
1089         False    False    False  False   False          False
1090         False    False    False  False   False          False
1091         False    False    False  False   False          False
1092         False    False    False  False   False          False
1093         False    False    False  False   False          False

[1094 rows x 6 columns]

In [32]:
df2.isnull().any()

Sales Person     False
Country          False
Product          False
Date             False
Amount           False
Boxes Shipped    False
dtype: bool

In [33]:
df2.isnull().sum()

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [34]:
df2["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [35]:
df2["Date"]

0       04-Jan-22
1       01-Aug-22
2       07-Jul-22
3       27-Apr-22
4       24-Feb-22
          ...
1089    17-May-22
1090    07-Jun-22
1091    26-Jul-22
1092    28-Jul-22
1093    23-May-22
Name: Date, Length: 1094, dtype: object

In [36]:
df2["Country"].mode()

0    Australia
dtype: object

In [37]:
df2["Boxes Shipped"].median()

135.0

In [38]:
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [2]:
df4 = pd.read_csv("chocolate_missing_data.csv")
df4

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180.0
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",NaN
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",NaN
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323.0
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119.0
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217.0
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384.0
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344.0

In [3]:
df4.isnull().sum()

Sales Person      0
Country           4
Product          13
Date             14
Amount            8
Boxes Shipped    20
dtype: int64

In [4]:
df4["Boxes Shipped"], df4["Amount"]

(0       180.0
 1         NaN
 2        91.0
 3         NaN
 4       184.0
         ...
 1089    323.0
 1090    119.0
 1091    217.0
 1092    384.0
 1093    344.0
 Name: Boxes Shipped, Length: 1094, dtype: float64,
 0        $5,320
 1        $7,896
 2        $4,501
 3       $12,726
 4       $13,685
           ...
 1089     $4,410
 1090     $6,559
 1091       $574
 1092     $2,086
 1093     $5,075
 Name: Amount, Length: 1094, dtype: object)

In [7]:
type(df4["Country"].mode()), df4["Country"].mode()[0]

(pandas.core.series.Series, 'Australia')

In [8]:
df4["Country"] = df4["Country"].fillna(df4["Country"].mode()[0])

In [9]:
df4.isnull().sum()

Sales Person      0
Country           0
Product          13
Date             14
Amount            8
Boxes Shipped    20
dtype: int64

In [10]:
df4.iloc[38]

Sales Person     Camilla Castle
Country               Australia
Product           85% Dark Bars
Date                  19-May-22
Amount                  $3,654
Boxes Shipped              14.0
Name: 38, dtype: object

In [11]:
df4["Boxes Shipped"].mean()

162.55214152700185

In [15]:
# df4 ü güncellemenin farklı bir yolu
df4["Boxes Shipped"].fillna(df4["Boxes Shipped"].mean(), inplace=True)

In [16]:
df4["Boxes Shipped"] = df4["Boxes Shipped"].fillna(df4["Boxes Shipped"].mean())

In [17]:
df4.isnull().sum()

Sales Person      0
Country           0
Product          13
Date             14
Amount            8
Boxes Shipped     0
dtype: int64

In [18]:
df4["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

Önce stringe çevirdik, ardından ondalık ayraç olan , ve $ işaretini kaldırdık.

In [23]:
df4["Amount"] = df4["Amount"].astype(str).str.replace("[$,]","", regex=True).astype(float)

regex programlamada belirli kalıplarla eşleşme var mı yok mu ona bakıyor. Detaylı bakabilirsin. Sadece replace kullanıldığında  [$,] bu sembolleri yan yana arar. Regex olarak aram yaptığımızda veride geçen bütün dolar ve virgülleri kaldır anlamına gelmektedir. Yeri farketmeksizin.

In [24]:
df4["Amount"]

0        5320.0
1        7896.0
2        4501.0
3       12726.0
4       13685.0
         ...
1089     4410.0
1090     6559.0
1091      574.0
1092     2086.0
1093     5075.0
Name: Amount, Length: 1094, dtype: float64

In [25]:
df4.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,5320.0,180.000000
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,7896.0,162.552142
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,4501.0,91.000000
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,12726.0,162.552142
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,13685.0,184.000000

In [43]:
#df4["Amount"].fillna(df4["Amount"].mean(), inplace=True)
df4["Amount"].fillna( df4["Amount"].mean(), inplace=True )

In [38]:
df4.isnull().sum()

Sales Person      0
Country           0
Product          13
Date             14
Amount            0
Boxes Shipped     0
dtype: int64

In [39]:
df4.groupby("Product")["Amount"].head()

0       5320.0
1       7896.0
2       4501.0
3      12726.0
4      13685.0
        ...
191     4333.0
195     4018.0
201     1162.0
206     9660.0
267     6454.0
Name: Amount, Length: 115, dtype: float64

In [40]:
# Producta göre o producta ait verilerin amount ortalaması ile doldur.
df4["Amount"] = df4.groupby("Product")["Amount"].apply(lambda x: x.fillna(x.mean()))

In [41]:
df4

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,5320.0,180.000000
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,7896.0,162.552142
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,4501.0,91.000000
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,12726.0,162.552142
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,13685.0,184.000000
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,4410.0,323.000000
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,6559.0,119.000000
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,574.0,217.000000
1092,Dotty Strutley,India,Eclairs,28-Jul-22,2086.0,384.000000
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,5075.0,344.000000

In [44]:
df4.isnull().sum()

Sales Person      0
Country           0
Product          13
Date             14
Amount            0
Boxes Shipped     0
dtype: int64

In [48]:
df4["Date"] = df4["Date"].fillna(method="ffill").fillna(method="bfill")
df4.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,5320.0,180.000000
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,7896.0,162.552142
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,4501.0,91.000000
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,12726.0,162.552142
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,13685.0,184.000000

In [47]:
df4.isnull().sum()

Sales Person      0
Country           0
Product          13
Date              0
Amount            0
Boxes Shipped     0
dtype: int64

## Her bir sales person için o kişinin en çok sattığı ürünü ile boş ürünü doldurunuz. (mod + groupby)